3_urban/3_exploration/workflow/models/openfoam/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location "0";
    object T;
}
dimensions [ 0 0 0 1 0 0 0 ];
internalField uniform 298.0;
boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    merged_domain_ground
    {
        type fixedValue;
        value uniform 298.0;
    }

    merged_inlet
    {
        type zeroGradient;
    }

    merged_outlet
    {
        type zeroGradient;
    }

    merged_domain
    {
        type zeroGradient;
    }

    merged_water
    {
        type fixedValue;
        value uniform 285.0;
    }

    merged_ground
    {
        type fixedValue;
        value uniform 290.0;
    }

    merged_building3
    {
        type zeroGradient;
    }

    merged_building2
    {
        type zeroGradient;
    }

    merged_building1
    {
        type zeroGradient;
    }

}
