3_urban/3_exploration/workflow/models/openfoam/system/comfortFoamDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5-dev                               |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "/";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          comfortFoamDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 1 met = 58.15 W/m²

clo	     0.6;	// Clothing, in clo
met	     1.2;	// Energy Conversion, in met
wme	     0;	// Mechanical Performance, in met (normal 0)
RH	     50;	// Room Air Humidity, in %
Zuluft	 10000;	// 10.000 m3/h Total Supply Air

// ************************************************************************* //
